# Data Input and Output

In [1]:
import pandas as pd

### 1- CSV Files `.csv`

In [2]:
# get csv file as dataframe 
df = pd.read_csv ('data/Example.csv')

In [3]:
df.head()

,Date,Open,High,Low,Close,Adj Close,Volume
0,2018-07-30,175.300003,175.300003,166.559998,171.059998,171.059998,65280800
1,2018-07-31,170.669998,174.240005,170.000000,172.580002,172.580002,40356500
2,2018-08-01,173.929993,175.080002,170.899994,171.649994,171.649994,34042100
3,2018-08-02,170.679993,176.789993,170.270004,176.369995,176.369995,32400000
4,2018-08-03,177.690002,178.850006,176.149994,177.779999,177.779999,24763400

In [4]:
# df

In [5]:
# Output dataframe as csv file
df.to_csv('clean_data.csv' , index=False)

### 2- Excel Files `.xlsx`

In [6]:
excel_df = pd.read_excel ('data/Excel_Sample.xlsx', sheet_name='Sheet1')

In [7]:
excel_df

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [8]:
excel_df.to_excel ('new_excel.xlsx',sheet_name='Sheet1')

### 3- HTML Files `.html`

In [9]:
# pip install lxml
# pip install html5lib
# pip install BeatufulSoup4

In [10]:
page_content = pd.read_html ('https://www.w3schools.com/html/html_tables.asp')

In [11]:
# Data came as lists
html_df = page_content[0]
html_df

                        Company           Contact  Country
0           Alfreds Futterkiste      Maria Anders  Germany
1    Centro comercial Moctezuma   Francisco Chang   Mexico
2                  Ernst Handel     Roland Mendel  Austria
3                Island Trading     Helen Bennett       UK
4  Laughing Bacchus Winecellars   Yoshi Tannamuri   Canada
5  Magazzini Alimentari Riuniti  Giovanni Rovelli    Italy

In [12]:
table2_df = page_content[1]
table2_df

          Tag                                        Description
0     <table>                                    Defines a table
1        <th>                   Defines a header cell in a table
2        <tr>                           Defines a row in a table
3        <td>                          Defines a cell in a table
4   <caption>                            Defines a table caption
5  <colgroup>  Specifies a group of one or more columns in a ...
6       <col>  Specifies column properties for each column wi...
7     <thead>               Groups the header content in a table
8     <tbody>                 Groups the body content in a table
9     <tfoot>               Groups the footer content in a table

### 4- SQL Data

In [13]:
# pip install sqlalchemy
from sqlalchemy import create_engine

In [14]:
con = create_engine ('sqlite:///:memory:')

In [15]:
html_df.to_sql ('data',con)

In [16]:
sql_df = pd.read_sql ('data',con=con)
sql_df

   index                       Company           Contact  Country
0      0           Alfreds Futterkiste      Maria Anders  Germany
1      1    Centro comercial Moctezuma   Francisco Chang   Mexico
2      2                  Ernst Handel     Roland Mendel  Austria
3      3                Island Trading     Helen Bennett       UK
4      4  Laughing Bacchus Winecellars   Yoshi Tannamuri   Canada
5      5  Magazzini Alimentari Riuniti  Giovanni Rovelli    Italy